
&НаСервере
Процедура Команда1НаСервере()
	НаборЗаписей = РегистрыСведений.ТарифЦеха.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		Если Не ЗначениеЗаполнено(ЗаписьНабора.СправочникТариф) Тогда
			НовыйЭлемент = Справочники.ТарифыЦеха.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЗаписьНабора);
			НовыйЭлемент.ДатаПрименения = ЗаписьНабора.Период;
			НовыйЭлемент.Записать();
			ЗаписьНабора.СправочникТариф = НовыйЭлемент.Ссылка;
		КонецЕсли;	
	КонецЦикла;
	НаборЗаписей.Записать();	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
