
&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	
	таблДокументов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктТовары.Ссылка КАК Акт,
		|	АктТовары.НомерСтроки КАК НомерСтроки,
		|	АктТовары.КодЗаказаСтрока КАК КодЗаказаСтрока,
		|	АктТовары.КодЗаказа КАК КодЗаказа
		|ИЗ
		|	Документ.Акт.Товары КАК АктТовары
		|ГДЕ
		|	АктТовары.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтрока =  таблДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаВыполнитьНаСервере()
	Для Каждого стрТаб Из таблДокументов Цикл
		Если ЗначениеЗаполнено(стрТаб.КодЗаказа)  Тогда 
			Продолжить;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(стрТаб.КодЗаказаСтрока) Тогда  
						
			Если Лев(стрТаб.КодЗаказаСтрока,1) = "/" Тогда
				ДатаИнтервалаГод 	=  "20"+Сред(СокрЛП(стрТаб.КодЗаказаСтрока),2,2);
			Иначе 	
				ДатаИнтервалаГод 	=  "20"+Сред(СокрЛП(стрТаб.КодЗаказаСтрока),4,2); 
			КонецЕсли;
			
			ДатаИнтервала 		= Дата(Число(ДатаИнтервалаГод),1,1);
			ДокументЗаявка 		= Документы.Заявка.НайтиПоНомеру(стрТаб.КодЗаказаСтрока, ДатаИнтервала);
			ДокументОбъект 		= стрТаб.Акт.ПолучитьОбъект();  
			
			текСтрока = ДокументОбъект.Товары.Получить(стрТаб.НомерСтроки - 1); 
			текСтрока.КодЗаказа = ДокументЗаявка; 
			ДокументОбъект.Записать();
			
		КонецЕсли;
	КонецЦикла;
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	КомандаВыполнитьНаСервере();
КонецПроцедуры
