   
Процедура ВыгрузитьДанные()  Экспорт   
	ИмяФайлаОбмена = "C:\Obmen\RA\ФайлОбмена.xml";
	Обработка 				= Обработки.УниверсальныйОбменДаннымиXML.Создать(); 
	Обработка.РежимОбмена 	= "Выгрузка";
    ВремФайл 				= ПолучитьИмяВременногоФайла("xml");
	МакетПравилОбмена 		= ПолучитьМакет("ПравилаОбмена");
	
	МакетПравилОбмена.Записать(ВремФайл);
	Обработка.ИмяФайлаПравилОбмена = ВремФайл;
	
	Обработка.ДатаНачала 		= НачалоМесяца(ТекущаяДата());
    Обработка.ДатаОкончания 	= КонецДня(ТекущаяДата()); 
	Обработка.ИмяФайлаОбмена 	= ИмяФайлаОбмена;
	
	Обработка.ЗагрузитьПравилаОбмена();
	НоваяСтрока = Обработка.ТаблицаНастройкиПараметров.Добавить();
	НоваяСтрока.Наименование = "Организация";
	НоваяСтрока.Имя 		 = "Организация";
	НоваяСтрока.Значение	 = Справочники.Организации.НайтиПоКоду("000000001");
	Обработка.ВыполнитьВыгрузку();
КонецПроцедуры  