#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ) 
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Автонаименование Тогда
		Наименование = СтрШаблон("%1, %2, %3", ?(ЗначениеЗаполнено(ВидРаботы),ВидРаботы,"Тариф"), СпособРасчетаТарифа, Тариф);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Структура =Новый Структура;
	Структура.Вставить("счПечатник", КолПечатников);
	Структура.Вставить("счТехник", КолТехников);
	Структура.Вставить("СпособРасчетаТарифа", СпособРасчетаТарифа);
	Структура.Вставить("ВидРаботы"			, ВидРаботы);
	Структура.Вставить("ПечатнаяМашина"		, ПечатнаяМашина);
	Структура.Вставить("ДатаПрименения"		, ДатаПрименения);	
	Структура.Вставить("ПроцентТехника"		, ПроцентТехника);
	Структура.Вставить("ПроцентПечатника"	, ПроцентПечатника);
	Структура.Вставить("Тариф"				, Тариф);
	Структура.Вставить("СправочникТариф"	, Ссылка);
	Структура.Вставить("Комментарий"		, Комментарий);
	
	ОбщегоНазначения.ПолучитьТарифНарядаИзРегистра(Структура);
	
КонецПроцедуры

#КонецОбласти
