&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ОсновнойТекст = СформироватьМакетНаСервере();
КонецПроцедуры

&НаСервере
Функция СформироватьМакетНаСервере2()  
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет 			= ОбработкаОбъект.ПолучитьМакет("Макет2"); 
	ОбластьМакета 	= Макет.ПолучитьОбласть("Шапка");
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция СформироватьМакетНаСервере()  
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет 			= ОбработкаОбъект.ПолучитьМакет("Макет"); 
	ОбластьМакета 	= Макет.ПолучитьОбласть("Шапка");
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция СформироватьМакетНаСервере3()  
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет 			= ОбработкаОбъект.ПолучитьМакет("Макет3"); 
	ОбластьМакета 	= Макет.ПолучитьОбласть("Шапка");
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаКлиенте
Процедура ВывестиМакет2(Команда)
	ОсновнойТекст = СформироватьМакетНаСервере2();
КонецПроцедуры

&НаКлиенте
Процедура ВывестиМакет3(Команда)
	ОсновнойТекст = СформироватьМакетНаСервере3();
КонецПроцедуры

&НаКлиенте
Процедура ВывестиМакет(Команда)
	ОсновнойТекст = СформироватьМакетНаСервере();
КонецПроцедуры
