// @strict-types

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Акт") Тогда
		Договор 		= ДанныеЗаполнения.Договор;
		Контрагент 		= ДанныеЗаполнения.Контрагент;
		Организация 	= ДанныеЗаполнения.Организация;
		Отвественный 	= ДанныеЗаполнения.Отвественный;
		Основание		= ДанныеЗаполнения.Ссылка;
		СуммаДокумента 	= ДанныеЗаполнения.СуммаДокумента;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Основание.СуммаДокумента;
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = Организация.Префикс;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЗначениеЗаполнено(Основание) Тогда 
		ДокументОбъект = Основание.ПолучитьОбъект();
		ДокументОбъект.СчетФактура = Ссылка;
		ДокументОбъект.Записать();
	КонецЕсли;	
КонецПроцедуры
