
&НаСервереБезКонтекста
Процедура Команда1НаСервере()
	пОбработка = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	пОбработка.ИмяФайлаОбмена = "C:\Obmen\RA\ФайлОбмена.xml";
	пОбработка.ИмяФайлаПравилОбмена = "";
	пОбработка.РежимОбмена = "Выгрузка";
	пОбработка.ВыполнитьЗагрузку();    
	
	//https://infostart.ru/1c/tools/154614/
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузить(Команда)
	ВыгрузитьНаСервере();
КонецПроцедуры 

&НаСервере
Процедура ВыгрузитьНаСервере()
	РеквизитФормыВЗначение("Объект").ВыгрузитьДанные();
КонецПроцедуры	
